Repository: hcakil/one_month_flutter
Catalog: lib/l10n/app_*.arb
Languages: tr

# appTitle
source: 30-Day Flutter + Web + AI Development Project
tr: 30 Günlük Flutter + Web + AI Gelişim Projesi

source: Project Purpose
tr: Proje Amacı

# projectDescription
source: This project is a comprehensive study repository created to support your 30-day Flutter learning plan.
tr: Bu proje, 30 günlük Flutter öğrenme planınızı desteklemek için oluşturulmuş kapsamlı bir çalışma deposudur.

# week1Title
source: Week 1 - Flutter & Web Modernization
tr: Hafta 1 - Flutter & Web Modernizasyonu

# day1Title
source: Day 1: Flutter 3.27+ Updates and Material 3
tr: Gün 1: Flutter 3.27+ Yenilikleri ve Material 3

# day1Description
source: What's New in Flutter, Material 3 widgets, Impeller Rendering
tr: What's New in Flutter, Material 3 widget'ları, Impeller Rendering

# day2Title
source: Day 2: State Management (Riverpod 3)
tr: Gün 2: State Management (Riverpod 3)

# day2Description
source: Modern state management with Riverpod
tr: Riverpod ile modern state management

# day3Title
source: Day 3: Responsive & Adaptive Layout
tr: Gün 3: Responsive & Adaptive Layout

# day3Description
source: LayoutBuilder, MediaQuery and adaptive design
tr: LayoutBuilder, MediaQuery ve adaptive tasarım

# day4Title
source: Day 4: Web Performance Optimization
tr: Gün 4: Web Performans İyileştirme

# day4Description
source: Deferred Components, CanvasKit vs HTML, optimization
tr: Deferred Components, CanvasKit vs HTML, optimizasyon

# day5Title
source: Day 5: SEO and Web Metadata
tr: Gün 5: SEO ve Web Metadata

# day5Description
source: seo_renderer, meta tags, route-based titles
tr: seo_renderer, meta tags, route bazlı başlık

# day6Title
source: Day 6: Mini Project (Responsive Web App)
tr: Gün 6: Mini Proje (Responsive Web App)

# flutterUpdatesTitle
source: Flutter 3.27+ Updates
tr: Flutter 3.27+ Yenilikleri

# flutterUpdatesDescription
source: In this section, we will explore Flutter's latest features and test the Material 3 design system.
tr: Bu bölümde Flutter'ın en son özelliklerini keşfedecek ve Material 3 tasarım sistemini test edeceğiz.

source: Material 3 Components
tr: Material 3 Bileşenleri

source: Buttons
tr: Butonlar

# cardsContainers
source: Cards and Containers
tr: Kartlar ve Konteynerlar

# impellerDescription
source: Impeller is Flutter's new rendering engine. It provides better performance and less jank.
tr: Impeller, Flutter'ın yeni rendering engine'idir. Daha iyi performans ve daha az jank sağlar.

source: Impeller Active
tr: Impeller Aktif

# renderingEngineSelection
source: Rendering engine selection (demo purpose)
tr: Rendering engine seçimi (demo amaçlı)

# impellerActiveStatus
source: ✅ Impeller: Active - Better performance!
tr: ✅ Impeller: Aktif - Daha iyi performans!

# skiaOldEngine
source: ⚠️ Skia: Old rendering engine
tr: ⚠️ Skia: Eski rendering engine

source: Other New Features
tr: Diğer Yeni Özellikler

source: Web Performance Improvements
tr: Web Performans İyileştirmeleri

# webPerformanceDescription
source: Faster loading and better SEO support
tr: Daha hızlı yüklenme ve daha iyi SEO desteği

source: Security Updates
tr: Güvenlik Güncellemeleri

# securityDescription
source: More secure APIs and dependency updates
tr: Daha güvenli API'ler ve dependency güncellemeleri

# developerDescription
source: Better hot reload and debugging tools
tr: Daha iyi hot reload ve debugging araçları

source: Platform Integration
tr: Platform Entegrasyonu

# platformDescription
source: Better native integration for iOS and Android
tr: iOS ve Android için daha iyi native entegrasyon

source: Day 1 Tasks
tr: Gün 1 Görevleri

# task1
source: Read What's New in Flutter
tr: What's New in Flutter oku

# task2
source: Test Material 3 widgets
tr: Material 3 widget'larını test et

# task3
source: Read Impeller Rendering
tr: Impeller Rendering oku

# task4
source: Enable Material 3 + Impeller in empty project
tr: Boş projede Material 3 + Impeller aktif et

source: Complete Day 1
tr: Gün 1'i Tamamla

# congratulationsMessage
source: Congratulations! You have completed Day 1 tasks! 🎉
tr: Tebrikler! Gün 1 görevlerini tamamladınız! 🎉

source: FilledButton clicked!
tr: FilledButton tıklandı!

source: Day
tr: Gün

source: Week
tr: Hafta

source: Month
tr: Ay

source: Change Language
tr: Dil Değiştir

source: English
tr: İngilizce

source: Turkish
tr: Türkçe

# impellerVsSkia
source: Impeller vs Skia Comparison
tr: Impeller vs Skia Karşılaştırması

source: Performance
tr: Performans

source: Memory Usage
tr: Bellek Kullanımı

source: Battery Life
tr: Batarya Ömrü

source: Animation Smoothness
tr: Animasyon Akıcılığı

source: Rendering Speed
tr: Rendering Hızı

source: Current Engine
tr: Mevcut Engine

source: Day 2 Tasks
tr: Gün 2 Görevleri

source: Complete Day 2
tr: Gün 2'yi Tamamla
